In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import glob

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:root@localhost/movies"

In [2]:
engine = create_engine(connection_str)

In [3]:
#Use glob to append data
q = "Data/final_tmdb_data_*.csv.gz"
chunked_files = glob.glob(q)
chunked_files

['Data\\final_tmdb_data_2000.csv.gz',
 'Data\\final_tmdb_data_2001.csv.gz',
 'Data\\final_tmdb_data_2002.csv.gz',
 'Data\\final_tmdb_data_2003.csv.gz',
 'Data\\final_tmdb_data_2004.csv.gz',
 'Data\\final_tmdb_data_2005.csv.gz',
 'Data\\final_tmdb_data_2006.csv.gz',
 'Data\\final_tmdb_data_2007.csv.gz',
 'Data\\final_tmdb_data_2008.csv.gz',
 'Data\\final_tmdb_data_2009.csv.gz']

In [4]:
## Loading all files as df and appending to a list
df_list = []
for file in chunked_files:
    print(file)
    temp_df = pd.read_csv(file,usecols=['imdb_id','revenue','budget','certification'])
    df_list.append(temp_df)
    #,usecols=['imdb_id','revenue','budget','certification']
## Concatenating the list of dfs into 1 combined
tmdb_data = pd.concat(df_list)

Data\final_tmdb_data_2000.csv.gz
Data\final_tmdb_data_2001.csv.gz
Data\final_tmdb_data_2002.csv.gz
Data\final_tmdb_data_2003.csv.gz
Data\final_tmdb_data_2004.csv.gz
Data\final_tmdb_data_2005.csv.gz
Data\final_tmdb_data_2006.csv.gz
Data\final_tmdb_data_2007.csv.gz
Data\final_tmdb_data_2008.csv.gz
Data\final_tmdb_data_2009.csv.gz

In [5]:
tmdb_data

        imdb_id      budget     revenue certification
0             0         NaN         NaN           NaN
1     tt0113026  10000000.0         0.0           NaN
2     tt0113092         0.0         0.0           NaN
3     tt0116391         0.0         0.0           NaN
4     tt0118694    150000.0  12854953.0            PG
...         ...         ...         ...           ...
2386  tt7786614         0.0         0.0           NaN
2387  tt8170758         0.0         0.0            NR
2388  tt9330112         0.0         0.0           NaN
2389  tt9556198         0.0         0.0           NaN
2390  tt9573984         0.0         0.0           NaN

[16209 rows x 4 columns]

In [6]:
tmdb_data.rename(columns={'imdb_id': 'tconst'},inplace=True)
tmdb_data.head()

      tconst      budget     revenue certification
0          0         NaN         NaN           NaN
1  tt0113026  10000000.0         0.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694    150000.0  12854953.0            PG

In [7]:
tmdb_data = tmdb_data[tmdb_data.tconst != '0']

In [8]:
len(tmdb_data)

16199

In [9]:
## get max string length
key_len = tmdb_data['tconst'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()

In [10]:
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'budget':Float(),
    'revenue':Float(),
    'certification':String(cert_len+1)}

In [11]:
tmdb_data

         tconst      budget     revenue certification
1     tt0113026  10000000.0         0.0           NaN
2     tt0113092         0.0         0.0           NaN
3     tt0116391         0.0         0.0           NaN
4     tt0118694    150000.0  12854953.0            PG
5     tt0118852         0.0         0.0             R
...         ...         ...         ...           ...
2386  tt7786614         0.0         0.0           NaN
2387  tt8170758         0.0         0.0            NR
2388  tt9330112         0.0         0.0           NaN
2389  tt9556198         0.0         0.0           NaN
2390  tt9573984         0.0         0.0           NaN

[16199 rows x 4 columns]

In [12]:
tmdb_data.drop_duplicates(inplace=True)

C:\Users\sushi\AppData\Local\Temp\ipykernel_9272\3258133511.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tmdb_data.drop_duplicates(inplace=True)

In [13]:
# Save to sql with dtype and index=False
tmdb_data.to_sql('tmdb_data_00s',engine,dtype=df_schema,if_exists='replace',index=False)
engine.execute('ALTER TABLE tmdb_data_00s ADD PRIMARY KEY (`tconst`);')